3A/SE465/Mutation-Testing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-20 Tue 13:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mutation Testing</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Mutation Testing</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org319441c">1. Test Case Effectiveness</a></li>
<li><a href="#orgf3e1aa9">2. Mutation Testing</a>
<ul>
<li><a href="#org11fb166">2.1. Mutation Operators</a></li>
</ul>
</li>
<li><a href="#org50be66d">3. Mutation Coverage</a>
<ul>
<li><a href="#org683855c">3.1. Types of Mutation Coverage</a>
<ul>
<li><a href="#orge25665a">3.1.1. Strong Mutation Coverage</a></li>
<li><a href="#org8dcc0a8">3.1.2. Weak Mutation Coverage</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org319441c" class="outline-2">
<h2 id="org319441c"><span class="section-number-2">1.</span> Test Case Effectiveness</h2>
<div class="outline-text-2" id="text-1">
<p>
The best test suite can detect every bug, whenever a bug is introduced
at least one test case will fail.
</p>

<p>
To measure effectiveness:
</p>
<ul class="org-ul">
<li>simple solution: find all bugs in the software (causality dilemma)</li>
<li>state-of-the-art solution: artificially inject bugs
<ul class="org-ul">
<li>mutation testing: modify some statements in code so that there
are different versions, where each version is a bug, to see if
the test cases can find the bugs</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf3e1aa9" class="outline-2">
<h2 id="orgf3e1aa9"><span class="section-number-2">2.</span> Mutation Testing</h2>
<div class="outline-text-2" id="text-2">
<p>
Fault-based testing: directed towards typical faults that could occur
in a program
</p>

<p>
Idea
</p>
<ul class="org-ul">
<li>create similar programs (mutants) differing in one small way (fault)</li>
<li>original test data is run through mutants</li>
<li>if test data detects all differences in mutants, then mutants
are dead, and test set is adequate</li>
</ul>

<p>
Should be used in conjunction with traditional testing techniques.
</p>

<p>
Mutants remain live either because it is equivalent to the original
program or test set is inadequate to kill the mutant.
Automated mutant generation uses mutation operators (predefined
program modification rules).
</p>

<p>
Insignificant mutants:
</p>
<ul class="org-ul">
<li><b>stillborn mutant</b>: synactically incorrect, killed by compiler</li>
<li><b>trivial mutant</b>: killed by almost any test case</li>
<li><b>equivalent mutant</b>: produces same output as original program
(undecidable problem)</li>
</ul>

<p>
Can design mutants that introduce non-functional issues (such
as performance), but infection and propagation are hard to define.
</p>
</div>
<div id="outline-container-org11fb166" class="outline-3">
<h3 id="org11fb166"><span class="section-number-3">2.1.</span> Mutation Operators</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Mutation operators change with programming languages, design,
and specification paradigm. They should be representative
of all realistic types of faults that could occur.
</p>

<p>
Specific operators are:
</p>
<ul class="org-ul">
<li>absolute value insertion</li>
<li>arithmetic operator replacement</li>
<li>relational operator replacement</li>
<li>conditional operator replacement</li>
<li>shift operator replacement</li>
<li>logical operator replacement</li>
<li>unary operator deletion</li>
<li>scalar variable replacement</li>
<li>bomb statement replacement</li>
</ul>

<p>
For OOP languages:
</p>
<ul class="org-ul">
<li>replacing type with compatible subtype</li>
<li>changing access modifier of attribute or method</li>
<li>changing instance creation expression</li>
<li>changing order of params in method definition</li>
<li>changing order of params in a call</li>
<li>removing an overloading method</li>
<li>reducing the number of params</li>
<li>removing an overriding method</li>
</ul>

<p>
<b>Competent programmer assumption</b>: given a spec a programmer
develops a programmer that is either correct or differs from
the correct program by a combination of simple errors
</p>

<p>
<b>Coupling effect assumption</b>: test data that distinguishes
all programs differing from a correct one by only
simple errors is so sensitive that it also implicitly
distinguishes more complex errors (complex faults
coupled to simple faults)
</p>
</div>
</div>
</div>
<div id="outline-container-org50be66d" class="outline-2">
<h2 id="org50be66d"><span class="section-number-2">3.</span> Mutation Coverage</h2>
<div class="outline-text-2" id="text-3">
<p>
Complete coverate equates to killing all non-equivalent
mutants, with the amount of coverage called mutation score.
\[
        \text{mutation score} = 100 * \frac{\text{dead mutants}}
        {(\text{\# of mutants} - \text{\# of equivalent mutants})}
\]
</p>

<p>
<b>Strong mutation</b>: fault must be reachable, infect the state,
and propagate to output
</p>

<p>
<b>Weak mutation</b>: fault which kills mutant needs only be reachable
and infect the state
</p>
</div>
<div id="outline-container-org683855c" class="outline-3">
<h3 id="org683855c"><span class="section-number-3">3.1.</span> Types of Mutation Coverage</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orge25665a" class="outline-4">
<h4 id="orge25665a"><span class="section-number-4">3.1.1.</span> Strong Mutation Coverage</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Strongly killing mutants
</p>
<ul class="org-ul">
<li>given a mutant \(m\) for a program \(P\) and a test case \(t\),
\(t\) is said to strongly kill \(m\) iff the output of \(t\)
on \(P\) is different from the output of \(t\) on \(M\)</li>
</ul>

<p>
<b>Strong mutation coverage</b>: for each mutant \(m\) in \(M\),
a test case exists that strongly kills \(m\)
</p>
</div>
</div>
<div id="outline-container-org8dcc0a8" class="outline-4">
<h4 id="org8dcc0a8"><span class="section-number-4">3.1.2.</span> Weak Mutation Coverage</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Weakly killing mutants
</p>
<ul class="org-ul">
<li>given a mutant \(m\) that modifies a source location \(L\)
in a program \(P\) and a test case \(t\),
\(t\) is said to weakly kill \(m\) iff the state of the
execution of \(P\) on \(t\) is different from the
state of the execution of \(m\) on \(t\),
immediately after some execution of \(L\)</li>
</ul>

<p>
<b>Weak mutation coverage</b>: for each mutant \(m\) in \(M\),
a test case exists that weakly kills \(m\)
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-20 Tue 13:05</p>
</div>
</body>
</html>
